#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/m-oka-system/azphoto/runs/run-QVHVtz2d8Eam7ye7

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.azurerm_subscription.primary: Refreshing...
data.azurerm_subscription.primary: Refresh complete after 0s [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_insights.app will be created
  + resource "azurerm_application_insights" "app" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "japaneast"
      + name                                  = (known after apply)
      + resource_group_name                   = "azphoto-dev-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # azurerm_cdn_frontdoor_custom_domain.app will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "app" {
      + cdn_frontdoor_profile_id = (known after apply)
      + dns_zone_id              = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = (sensitive value)
      + id                       = (known after apply)
      + name                     = (sensitive value)
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # azurerm_cdn_frontdoor_custom_domain_association.app will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "app" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # azurerm_cdn_frontdoor_endpoint.endpoint will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "azphoto-dev-afd-endpoint"
    }

  # azurerm_cdn_frontdoor_origin.app will be created
  + resource "azurerm_cdn_frontdoor_origin" "app" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "azphoto-dev-afd-app-origin"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 1000
    }

  # azurerm_cdn_frontdoor_origin.blob will be created
  + resource "azurerm_cdn_frontdoor_origin" "blob" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "azphoto-dev-afd-blob-origin"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 1000
    }

  # azurerm_cdn_frontdoor_origin_group.app will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "app" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "azphoto-dev-afd-app-backend"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 0
      + session_affinity_enabled                                  = false

      + health_probe {
          + interval_in_seconds = 100
          + path                = "/"
          + protocol            = "Https"
          + request_type        = "HEAD"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # azurerm_cdn_frontdoor_origin_group.blob will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "blob" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "azphoto-dev-afd-blob-backend"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 0
      + session_affinity_enabled                                  = false

      + health_probe {
          + interval_in_seconds = 100
          + path                = "/"
          + protocol            = "Https"
          + request_type        = "HEAD"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # azurerm_cdn_frontdoor_profile.profile will be created
  + resource "azurerm_cdn_frontdoor_profile" "profile" {
      + id                       = (known after apply)
      + name                     = "azphoto-dev-afd"
      + resource_group_name      = "azphoto-dev-rg"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 60
      + sku_name                 = "Standard_AzureFrontDoor"
    }

  # azurerm_cdn_frontdoor_route.app will be created
  + resource "azurerm_cdn_frontdoor_route" "app" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = (known after apply)
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpsOnly"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = true
      + name                            = "azphoto-dev-afd-app-route"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]
    }

  # azurerm_cdn_frontdoor_route.blob will be created
  + resource "azurerm_cdn_frontdoor_route" "blob" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = (known after apply)
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpsOnly"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = true
      + name                            = "azphoto-dev-afd-blob-route"
      + patterns_to_match               = [
          + "/media/*",
          + "/static/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]

      + cache {
          + compression_enabled           = true
          + content_types_to_compress     = [
              + "text/html",
              + "text/css",
              + "text/javascript",
            ]
          + query_string_caching_behavior = "IgnoreQueryString"
          + query_strings                 = []
        }
    }

  # azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + login_server                  = (known after apply)
      + name                          = "azphotodevacr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "azphoto-dev-rg"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_dns_cname_record.afd_cname will be created
  + resource "azurerm_dns_cname_record" "afd_cname" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = (known after apply)
      + resource_group_name = "azphoto-dev-rg"
      + ttl                 = 3600
      + zone_name           = (sensitive value)
    }

  # azurerm_dns_txt_record.afd_validation will be created
  + resource "azurerm_dns_txt_record" "afd_validation" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.www"
      + resource_group_name = "azphoto-dev-rg"
      + ttl                 = 3600
      + zone_name           = (sensitive value)

      + record {
          + value = (known after apply)
        }
    }

  # azurerm_dns_zone.public will be created
  + resource "azurerm_dns_zone" "public" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = (sensitive value)
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "azphoto-dev-rg"
    }

  # azurerm_key_vault.app will be created
  + resource "azurerm_key_vault" "app" {
      + access_policy                 = []
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + name                          = "azphoto-dev-vault"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "azphoto-dev-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "7be8e2c6-3f1e-47d6-a7e3-b4c7f5f69071"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
          + ip_rules       = (sensitive value)
        }
    }

  # azurerm_key_vault_secret.appinsights will be created
  + resource "azurerm_key_vault_secret" "appinsights" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "APPINSIGHTS-CONNECTION-STRING"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.db_host will be created
  + resource "azurerm_key_vault_secret" "db_host" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DB-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.db_name will be created
  + resource "azurerm_key_vault_secret" "db_name" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DB-NAME"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.db_password will be created
  + resource "azurerm_key_vault_secret" "db_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DB-PASSWORD"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.db_username will be created
  + resource "azurerm_key_vault_secret" "db_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DB-USERNAME"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.default_from_email will be created
  + resource "azurerm_key_vault_secret" "default_from_email" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DEFAULT-FROM-EMAIL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_host will be created
  + resource "azurerm_key_vault_secret" "redis_host" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "REDIS-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_key will be created
  + resource "azurerm_key_vault_secret" "redis_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "REDIS-KEY"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.secret_key will be created
  + resource "azurerm_key_vault_secret" "secret_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DJANGO-SECRET-KEY"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sendgrid_api_key will be created
  + resource "azurerm_key_vault_secret" "sendgrid_api_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SENDGRID-API-KEY"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.webappcontainer_client_id will be created
  + resource "azurerm_key_vault_secret" "webappcontainer_client_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "WEBAPPCONTAINER-CLIENT-ID"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_web_app.app will be created
  + resource "azurerm_linux_web_app" "app" {
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "japaneast"
      + name                              = (known after apply)
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "azphoto-dev-rg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + virtual_network_subnet_id         = (known after apply)
      + zip_deploy_file                   = (known after apply)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + site_config {
          + always_on                                     = false
          + container_registry_managed_identity_client_id = (known after apply)
          + container_registry_use_managed_identity       = true
          + default_documents                             = (known after apply)
          + detailed_error_logging_enabled                = (known after apply)
          + ftps_state                                    = "Disabled"
          + health_check_eviction_time_in_min             = (known after apply)
          + http2_enabled                                 = false
          + ip_restriction                                = [
              + {
                  + action      = "Allow"
                  + headers     = [
                      + {
                          + x_azure_fdid = (known after apply)
                        },
                    ]
                  + name        = "AllowFrontDoorAddress"
                  + priority    = 100
                  + service_tag = "AzureFrontDoor.Backend"
                },
            ]
          + linux_fx_version                              = (known after apply)
          + load_balancing_mode                           = "LeastRequests"
          + local_mysql_enabled                           = false
          + managed_pipeline_mode                         = "Integrated"
          + minimum_tls_version                           = "1.2"
          + remote_debugging_enabled                      = false
          + remote_debugging_version                      = (known after apply)
          + scm_ip_restriction                            = (known after apply)
          + scm_minimum_tls_version                       = "1.2"
          + scm_type                                      = (known after apply)
          + scm_use_main_ip_restriction                   = false
          + use_32_bit_worker                             = true
          + vnet_route_all_enabled                        = true
          + websockets_enabled                            = false
          + worker_count                                  = (known after apply)
        }
    }

  # azurerm_log_analytics_workspace.app will be created
  + resource "azurerm_log_analytics_workspace" "app" {
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + location                           = "japaneast"
      + name                               = (known after apply)
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "azphoto-dev-rg"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + workspace_id                       = (known after apply)
    }

  # azurerm_monitor_diagnostic_setting.app will be created
  + resource "azurerm_monitor_diagnostic_setting" "app" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = (known after apply)
      + target_resource_id         = (known after apply)

      + log {
          + category = "AppServiceAppLogs"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + log {
          + category = "AppServiceAuditLogs"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + log {
          + category = "AppServiceConsoleLogs"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + log {
          + category = "AppServiceHTTPLogs"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + log {
          + category = "AppServiceIPSecAuditLogs"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + log {
          + category = "AppServicePlatformLogs"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # azurerm_mysql_flexible_database.mysql will be created
  + resource "azurerm_mysql_flexible_database" "mysql" {
      + charset             = "utf8mb4"
      + collation           = "utf8mb4_0900_ai_ci"
      + id                  = (known after apply)
      + name                = (sensitive value)
      + resource_group_name = "azphoto-dev-rg"
      + server_name         = (known after apply)
    }

  # azurerm_mysql_flexible_server.mysql will be created
  + resource "azurerm_mysql_flexible_server" "mysql" {
      + administrator_login           = (sensitive value)
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "japaneast"
      + name                          = (known after apply)
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "azphoto-dev-rg"
      + sku_name                      = "B_Standard_B1s"
      + version                       = "8.0.21"
      + zone                          = "1"

      + storage {
          + auto_grow_enabled = true
          + iops              = 360
          + size_gb           = 20
        }
    }

  # azurerm_mysql_flexible_server_configuration.ssl_config will be created
  + resource "azurerm_mysql_flexible_server_configuration" "ssl_config" {
      + id                  = (known after apply)
      + name                = "require_secure_transport"
      + resource_group_name = "azphoto-dev-rg"
      + server_name         = (known after apply)
      + value               = "ON"
    }

  # azurerm_private_dns_zone.mysql will be created
  + resource "azurerm_private_dns_zone" "mysql" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = (known after apply)
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "azphoto-dev-rg"
    }

  # azurerm_private_dns_zone_virtual_network_link.mysql will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "mysql" {
      + id                    = (known after apply)
      + name                  = "mysqlfsVnetZone"
      + private_dns_zone_name = (known after apply)
      + registration_enabled  = false
      + resource_group_name   = "azphoto-dev-rg"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 0
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "japaneast"
      + minimum_tls_version           = "1.2"
      + name                          = (known after apply)
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "azphoto-dev-rg"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "japaneast"
      + name     = "azphoto-dev-rg"
    }

  # azurerm_role_assignment.webappcontainer[0] will be created
  + resource "azurerm_role_assignment" "webappcontainer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.webappcontainer[1] will be created
  + resource "azurerm_role_assignment" "webappcontainer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.webappcontainer[2] will be created
  + resource "azurerm_role_assignment" "webappcontainer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_service_plan.app will be created
  + resource "azurerm_service_plan" "app" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "japaneast"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "azphoto-dev-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "azphoto-dev-rg"
      + sku_name                     = "B1"
      + worker_count                 = (known after apply)
    }

  # azurerm_storage_account.app will be created
  + resource "azurerm_storage_account" "app" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "japaneast"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "azphoto-dev-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_storage_container.media will be created
  + resource "azurerm_storage_container" "media" {
      + container_access_type   = "blob"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "media"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = (known after apply)
    }

  # azurerm_storage_container.static will be created
  + resource "azurerm_storage_container" "static" {
      + container_access_type   = "blob"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "static"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = (known after apply)
    }

  # azurerm_subnet.spoke1_app will be created
  + resource "azurerm_subnet" "spoke1_app" {
      + address_prefixes                               = [
          + "10.10.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "app"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "azphoto-dev-rg"
      + virtual_network_name                           = "azphoto-dev-spoke1-vnet"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # azurerm_subnet.spoke1_db will be created
  + resource "azurerm_subnet" "spoke1_db" {
      + address_prefixes                               = [
          + "10.10.3.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "db"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "azphoto-dev-rg"
      + virtual_network_name                           = "azphoto-dev-spoke1-vnet"

      + delegation {
          + name = "dlg-Microsoft.DBforMySQL-flexibleServers"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforMySQL/flexibleServers"
            }
        }
    }

  # azurerm_subnet.spoke1_endpoint will be created
  + resource "azurerm_subnet" "spoke1_endpoint" {
      + address_prefixes                               = [
          + "10.10.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "endpoint"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "azphoto-dev-rg"
      + virtual_network_name                           = "azphoto-dev-spoke1-vnet"
    }

  # azurerm_user_assigned_identity.webappcontainer will be created
  + resource "azurerm_user_assigned_identity" "webappcontainer" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "japaneast"
      + name                = "azphoto-dev-webappcontainer-mngid"
      + principal_id        = (known after apply)
      + resource_group_name = "azphoto-dev-rg"
      + tenant_id           = (known after apply)
    }

  # azurerm_virtual_network.spoke1 will be created
  + resource "azurerm_virtual_network" "spoke1" {
      + address_space       = [
          + "10.10.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "japaneast"
      + name                = "azphoto-dev-spoke1-vnet"
      + resource_group_name = "azphoto-dev-rg"
      + subnet              = (known after apply)
    }

  # random_integer.num will be created
  + resource "random_integer" "num" {
      + id     = (known after apply)
      + max    = 99999
      + min    = 10000
      + result = (known after apply)
    }

  # module.blob_pep.azurerm_private_dns_a_record.this will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + records             = (known after apply)
      + resource_group_name = "azphoto-dev-rg"
      + ttl                 = 300
      + zone_name           = "privatelink.blob.core.windows.net"
    }

  # module.blob_pep.azurerm_private_dns_zone.this will be created
  + resource "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "azphoto-dev-rg"
    }

  # module.blob_pep.azurerm_private_dns_zone_virtual_network_link.this will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "this" {
      + id                    = (known after apply)
      + name                  = "vnetlink"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "azphoto-dev-rg"
      + virtual_network_id    = (known after apply)
    }

  # module.blob_pep.azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = (known after apply)
      + id                            = (known after apply)
      + location                      = "japaneast"
      + name                          = (known after apply)
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "azphoto-dev-rg"
      + subnet_id                     = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.redis_pep.azurerm_private_dns_a_record.this will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + records             = (known after apply)
      + resource_group_name = "azphoto-dev-rg"
      + ttl                 = 300
      + zone_name           = "privatelink.redis.cache.windows.net"
    }

  # module.redis_pep.azurerm_private_dns_zone.this will be created
  + resource "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.redis.cache.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "azphoto-dev-rg"
    }

  # module.redis_pep.azurerm_private_dns_zone_virtual_network_link.this will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "this" {
      + id                    = (known after apply)
      + name                  = "vnetlink"
      + private_dns_zone_name = "privatelink.redis.cache.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "azphoto-dev-rg"
      + virtual_network_id    = (known after apply)
    }

  # module.redis_pep.azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = (known after apply)
      + id                            = (known after apply)
      + location                      = "japaneast"
      + name                          = (known after apply)
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "azphoto-dev-rg"
      + subnet_id                     = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.vault_pep.azurerm_private_dns_a_record.this will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "azphoto-dev-vault"
      + records             = (known after apply)
      + resource_group_name = "azphoto-dev-rg"
      + ttl                 = 300
      + zone_name           = "privatelink.vaultcore.azure.net"
    }

  # module.vault_pep.azurerm_private_dns_zone.this will be created
  + resource "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "azphoto-dev-rg"
    }

  # module.vault_pep.azurerm_private_dns_zone_virtual_network_link.this will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "this" {
      + id                    = (known after apply)
      + name                  = "vnetlink"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "azphoto-dev-rg"
      + virtual_network_id    = (known after apply)
    }

  # module.vault_pep.azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "azphoto-dev-vault-pep-nic"
      + id                            = (known after apply)
      + location                      = "japaneast"
      + name                          = "azphoto-dev-vault-pep"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "azphoto-dev-rg"
      + subnet_id                     = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

Plan: 62 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dns_zone_name_servers = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 56 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @m-oka-system, Action: `pull_request`*